# Packages
brew "bat"
brew "direnv"
brew "fd"
brew "flux"
brew "git-delta"
brew "gitops"
brew "helm"
brew "kubernetes-cli"
brew "kubeseal"
brew "jq"
brew "ncurses"
brew "neovim"
brew "oh-my-posh"
brew "tree-sitter"
brew "vivid"
brew "eza"
brew "fzf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "xz"
brew "z"
brew "zoxide"

# Official Amazon AWS command-line interface
brew "awscli"

# Integrated shell for working with the AWS CLI
brew "aws-shell"

# Utility for easily assuming AWS IAM roles from the command-line
brew "aws-vault"

# Tool to generate documentation from Terraform modules
brew "terraform-docs"

# Linter for Terraform files
brew "tflint"

# Framework for managing multi-language pre-commit hooks
brew "pre-commit"

# Terraform version manager
brew "tfenv"
